; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?x ?y)
	       (ontable ?x)
	       (clear ?x)
	       (handempty)
	       (holding ?x)
	       )

  (:action pick-up
	     :parameters (?x)
	     :precondition (and (clear ?x) (ontable ?x) (handempty))
	     :effect
	     (and (not (ontable ?x))
		   (not (clear ?x))
		   (not (handempty))
		   (holding ?x)))

  (:action put-down
	     :parameters (?x)
	     :precondition (holding ?x)
	     :effect
	     (and (not (holding ?x))
		   (clear ?x)
		   (handempty)
		   (ontable ?x)))
  (:action stack
	     :parameters (?x ?y)
	     :precondition (and (holding ?x) (clear ?y))
	     :effect
	     (and (not (holding ?x))
		   (not (clear ?y))
		   (clear ?x)
		   (handempty)
		   (on ?x ?y)))
  (:action unstack
	     :parameters (?x ?y)
	     :precondition (and (on ?x ?y) (clear ?x) (handempty))
	     :effect
	     (and (holding ?x)
		   (clear ?y)
		   (not (clear ?x))
		   (not (handempty))
		   (not (on ?x ?y)))))

; problem
(define (problem BLOCKS-10-0)
(:domain BLOCKS)
(:objects  A B C D E F G H I J)
(:init (HANDEMPTY)(ON A E)(CLEAR A)(ON B D)(CLEAR B)(ONTABLE C)(ONTABLE D)(ONTABLE E)(ON F J)(CLEAR F)(ON G C)(CLEAR G)(ONTABLE H)(ON I H)(CLEAR I)(ONTABLE J))
(:goal (AND (HANDEMPTY)(ONTABLE A)(ONTABLE B)(ON C H)(ON D A)(ONTABLE E)(CLEAR E)(ON F I)(CLEAR F)(ON G J)(CLEAR G)(ON H D)(ON I C)(ON J B)))
)

; plan
1. (unstack a e)
   deleted: (clear a) (handempty) (on a e)
   added: (holding a) (clear e)
   goals met: 4 of 14
2. (put-down a)
   deleted: (holding a)
   added: (clear a) (handempty) (ontable a)
   goals met: 6 of 14
3. (unstack b d)
   deleted: (clear b) (handempty) (on b d)
   added: (holding b) (clear d)
   goals met: 5 of 14
4. (put-down b)
   deleted: (holding b)
   added: (clear b) (handempty) (ontable b)
   goals met: 7 of 14
5. (pick-up d)
   deleted: (ontable d) (clear d) (handempty)
   added: (holding d)
   goals met: 6 of 14
6. (stack d a)
   deleted: (holding d) (clear a)
   added: (clear d) (handempty) (on d a)
   goals met: 8 of 14
7. (unstack f j)
   deleted: (clear f) (handempty) (on f j)
   added: (holding f) (clear j)
   goals met: 6 of 14
8. (stack f i)
   deleted: (holding f) (clear i)
   added: (clear f) (handempty) (on f i)
   goals met: 9 of 14
9. (pick-up j)
   deleted: (ontable j) (clear j) (handempty)
   added: (holding j)
   goals met: 8 of 14
10. (stack j b)
   deleted: (holding j) (clear b)
   added: (clear j) (handempty) (on j b)
   goals met: 10 of 14
11. (unstack g c)
   deleted: (clear g) (handempty) (on g c)
   added: (holding g) (clear c)
   goals met: 8 of 14
12. (stack g j)
   deleted: (holding g) (clear j)
   added: (clear g) (handempty) (on g j)
   goals met: 11 of 14
13. (unstack f i)
   deleted: (clear f) (handempty) (on f i)
   added: (holding f) (clear i)
   goals met: 8 of 14
14. (put-down f)
   deleted: (holding f)
   added: (clear f) (handempty) (ontable f)
   goals met: 10 of 14
15. (unstack i h)
   deleted: (clear i) (handempty) (on i h)
   added: (holding i) (clear h)
   goals met: 9 of 14
16. (stack i c)
   deleted: (holding i) (clear c)
   added: (clear i) (handempty) (on i c)
   goals met: 11 of 14
17. (pick-up h)
   deleted: (ontable h) (clear h) (handempty)
   added: (holding h)
   goals met: 10 of 14
18. (stack h d)
   deleted: (holding h) (clear d)
   added: (clear h) (handempty) (on h d)
   goals met: 12 of 14
19. (unstack i c)
   deleted: (clear i) (handempty) (on i c)
   added: (holding i) (clear c)
   goals met: 10 of 14
20. (put-down i)
   deleted: (holding i)
   added: (clear i) (handempty) (ontable i)
   goals met: 11 of 14
21. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 10 of 14
22. (stack c h)
   deleted: (holding c) (clear h)
   added: (clear c) (handempty) (on c h)
   goals met: 12 of 14
23. (pick-up i)
   deleted: (ontable i) (clear i) (handempty)
   added: (holding i)
   goals met: 11 of 14
24. (stack i c)
   deleted: (holding i) (clear c)
   added: (clear i) (handempty) (on i c)
   goals met: 13 of 14
25. (pick-up f)
   deleted: (ontable f) (clear f) (handempty)
   added: (holding f)
   goals met: 11 of 14
26. (stack f i)
   deleted: (holding f) (clear i)
   added: (clear f) (handempty) (on f i)
   goals met: 14 of 14
